/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putnbr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yoohwang <yoohwang@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/08/10 00:44:27 by yoohwang          #+#    #+#             */
/*   Updated: 2026/08/10 01:44:22 by yoohwang         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <unistd.h>

void	ft_putnbr(int nb)
{
	char	i;

	if (nb < 0)
	{
		write(1, "-", 1);
		nb = -nb;
	}
	if (nb < 10)
	{
		i = '0' + (nb % 10);
		write(1, &i, 1);
		return ;
	}
	ft_putnbr(nb / 10);
	i = '0' + (nb % 10);
	write(1, &i, 1);
}

/**
 * @brief 매개변수로 전달된 숫자를 출력하는 함수
 * 입력받은 숫자를 + '0' 하여 출력하도록
 * 자릿수는 음수부터 양수까지 엄청 많음...
 * 
 */